Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: in KRLE involves being able to apply different ways of viewing historic time and ways of presenting yearly cycles, finding one's way through religious texts, encountering mathematical expressions and numerical symbolism, and interpreting and using statistics.
nb: i KRL innebærer å kunne anvende ulike tidsregninger og måter å framstille årsrytmen på, finne fram i religiøse skrifter, møte matematiske uttrykk og tallsymbolikk og tolke og bruke statistikk.

source: An AifL school is a school in which every-
nb: en aifl-skule er en skule der alle lærer i

source: discuss and elaborate on selected texts from Hindu written traditions
nb: drøfte utvalgte tekster fra hinduistisk skrifttradisjon

source: Along with her researcher colleague Tor Nilsson, she has examined which elements employees in Swedish ECEC institutions include in their work with technology.
nb: Sammen med forsker Tor Nilsson har hun undersøkt hvilke elementer de ansatte i svenske barnehager inkluderer i arbeidet med teknologi.

source: discuss and elaborate on premises for sustainable development
nb: drøfte premisser for bærekraftig utvikling

source: select and use appropriate reading and listening strategies to locate information in oral and written texts
nb: velge og bruke egnede lese- og lyttestrategier til å finne informasjon i muntlige og skriftlige tekster

source: The children were eager to participate.
nb: Ungene var deltakende og svært aktive.

source: represent fractions in different ways and switch between the different
nb: representere brøker på ulike måter og oversette mellom de ulike

source: explore geometric figures and patterns
nb: utforske geometriske figurer og mønstre

source: It is important that adults help facilitate the development of children’s ability to play.
nb: Det er viktig at voksne gjør noe for å utvikle barns evne til å leke.

source: explore the properties of different polygons and explain the concepts
nb: utforske egenskapene ved ulike polygoner og forklare begrepene

source: ‘From this perspective, it is no more natural to play than to draw, make music or stage plays, for example.’
nb: – Det er på den måten ikke mer naturlig å leke enn å tegne, skape musikk eller teater, for eksempel.

source: present day and assess its significance for how people have perceived themselves and others
nb: frigjøring i norsk og samisk historie, og gjøre rede for hvordan de samtidig har bidratt til utviklingen av demokratiet

source: Knowledge on the situation for indigenous peoples, minority peoples in the world in general and the Sami people in particular, is also part of the subject.
nb: Arbeid i faget skal stimulere til drøfting av sammenhenger mellom produksjon og forbruk og vurdering av de konsekvenser ressursbruk og livsutfoldelse har på miljøet og en bærekraftig utvikling.

source: Cooperation and communication skills shall be key elements in the teaching.
nb: Samarbeid og kommunikasjonsferdigheter skal stå sentralt i opplæringen.

source: define the term social problems and make use of sociological theories to analyse the causes of the problems
nb: definere begrepet sosiale problemer og bruke samfunnsvitenskapelige teorier til å analysere årsaker til problemene

source: English-language competence is in many cases a requirement for using digital tools, and using such tools may also help the development of English linguistic competence.
nb: Engelskspråklig kompetanse er i mange tilfeller en forutsetning for å kunne ta i bruk digitale verktøy.

source: The development of numeracy in Mathematics begins with a basic understanding of numbers, pinpointing and solving problems in simple situations and gradually leads to analysing and solving a wide range of complex problems using a varied selection of strategies and methods.
nb: Utviklingen av å regne i matematikk går fra grunnleggende tallforståelse og å gjenkjenne og løse problemer ut fra enkle situasjoner til å analysere og løse et spekter av komplekse problemer med et variert utvalg av strategier og metoder.

source: in English is a key part of developing English linguistic competence and is a common thread throughout the competence objectives at all levels.
nb: i engelsk er sentralt i utviklingen av engelsk språkkompetanse og går igjen i kompetansemålene for alle trinn.

source: give an account of how light detectors work in digital photography or digital video
nb: gjøre rede for virkemåten til lysdetektorer i digital fotografering eller digital video

source: describe in Norwegian or Sign Language how rhythm, volume of speech, intonation, mimicry and body language can help create linguistic content
nb: forklare på norsk eller tegnspråk hvordan rytme, stemmestyrke, intonasjon, mimikk og kroppsspråk kan bidra til språklig innhold

source: The researchers found it mainly to be the planned, goal-oriented activities that are documented.
nb: Det er primært de planlagte og målrettede aktivitetene som dokumenteres, finner forskerne.

source: express themselves using a varied vocabulary and master linguistic rules
nb: uttrykke seg med et variert ordforråd og mestre språklige formkrav

source: concerns developing reading and writing skills.
nb: dreier seg om å utvikle lese- og skrivekompetanse.

source: Population and settlement geography
nb: befolknings- og bosettingsgeografi

source: Thus, certain operations became impediments to the children’s own development’, Ehrlin points out.
nb: Dermed ble det en hindring for barnas egenutvikling, forteller Ehrlin.

source: investigate and discuss the use and misuse of resources, consequences this might have for the environment and society, and conflicts this can create locally and globally
nb: undersøke og diskutere bruk og misbruk av ressurser, konsekvenser det kan få for miljøet og samfunnet, og konflikter det kan skape lokalt og globalt

source: in RLE is helpful to explore religion and philosophies of life to find different presentations and perspectives.
nb: i KRL er en hjelp til å utforske religioner og livssyn for å finne ulike presentasjoner og perspektiver.

source: recognise, experiment with, describe and further develop structures in simple number patterns
nb: gjenkjenne, eksperimentere med, beskrive og videreføre strukturer i tallmønster

source: The core element craft skills involves mastery, and the development of practical skills and patience by using a variety of tools and materials.
nb: Kjerneelementet håndverksferdigheter innebærer at elevene skal utvikle håndlag, praktiske ferdigheter og utholdenhet ved å bruke ulike redskaper og materialer.

source: Digital skills involve developing knowledge about copyright and protection of personal privacy through verifiable references to sources.
nb: Skriving er en måte å utvikle og strukturere ideer og tanker på, men også en kommunikasjonsform og en metode for å lære.

source: Basic skills are integrated in the competence objectives where they contribute to the development of competence in the subject, while also being part of this competence.
nb: Grunnleggende ferdigheter er integrert i kompetansemålene der de bidrar til utvikling av og er en del av fagkompetansen.

source: Social English and English literature and culture can be taken independently of each other; both build on International English.
nb: Samfunnsfaglig engelsk og engelskspråklig litteratur og kultur kan tas uavhengig av hverandre og bygger hver for seg på internasjonal engelsk.

source: ‘This is especially true at this time of the year, when it’s cold outside and warm inside’, Alexander points out.
nb: Særlig på denne tiden av året, når det er kaldt ute og varmt inne, forteller Alexander.

source: Curriculum for Food and Health
nb: Læreplan i samisk historie og samfunn

source: plan, carry out, analyze and document systematic measurements for noise, air pollution, indoor climates and water quality, and elaborate on and discuss climatic and health-related effects
nb: planlegge, gjennomføre, analysere og dokumentere systematiske målinger om støy, luftforurensning, inneklima og vannkvalitet, og drøfte virkninger på helse og miljø

source: describe the temple and monastery, reflect on their significance and use, and use digital tools to search for information and make presentations about this
nb: beskrive tempelet og klosteret og reflektere over deres betydning og bruk og nytte digitale verktøy til å søke informasjon og lage presentasjoner

source: read a selection of contemporary texts in Bokmål and Nynorsk and discuss how these texts relate to the modern day both linguistically and thematically
nb: lese et utvalg samtidstekster på bokmål og nynorsk og drøfte hvordan disse tekstene språklig og tematisk forholder seg til vår tid

source: in Mathematics X involves using digital tools for comprehensive computations and visualization.
nb: i matematikk X innebærer å bruke digitale verktøy til omfattende beregninger og visualisering.

source: The pupils improve their practical skills and the ability to ask questions, face everyday challenges and see the potential in unfamiliar situations.
nb: Elevene opparbeider praktiske ferdigheter og evne til å stille spørsmål, møte utfordringer i hverdagen og se muligheter i ukjente situasjoner.

source: describe his/her own work in learning English
nb: formidle på norsk eller tegnspråk et budskap med sammenheng og presisjon

source: Furthermore, they also demonstrate and develop competence in mathematics when reasoning about and arguing for solutions and mathematical connections.
nb: Videre viser og utvikler de kompetanse i matematikk når de resonnerer over og argumenterer for løsninger og matematiske sammenhenger.

source: The labour market and unemployment
nb: Arbeidsmarked og arbeidsledighet

source: convert a practical problem into an equation, an inequality or an equation system, solve it with and without using digital tools, present and provide rationale for the chosen solution and assess the validity of the solution
nb: omforme en praktisk problemstilling til en ligning, en ulikhet eller et ligningssystem, løse det matematiske problemet både med og uten digitale verktøy, presentere og begrunne løsningen og vurdere gyldighetsområde og begrensninger

source: Knowledge of religions and philosophies of life is important for human beings to understand their existence and to gain an understanding of cultures within one's own society and in societies around the world.
nb: Kunnskap om religioner og livssyn er vesentlig for enkeltmennesket, for å kunne tolke tilværelsen og for å forstå kulturer i ens eget samfunn og i samfunn verden over.

source: Practical creative work is important, where the emphasis is on skills, trying out new things and creativity.
nb: Kjerneelementet handler videre om utvikling av kunnskap om og forståelse av samiske tradisjoner, herunder bruk og ressursutnyttelse av land og vann og bærekraftig utvikling i tråd med naturressursene.

source: Children who do not take initiatives risk not being heard at all in a kindergarten with large groups of children’, in the researcher’s opinion.
nb: Barn som i liten grad tar initiativ, risikerer å bli veldig lite hørt på i en barnehage med store barnegrupper, mener forskeren.

source: This means understanding texts, tables and diagrams from textbooks, reference works, newspapers, journals, advertisements and the Internet.
nb: Det vil si å forstå tekster, tabeller og diagrammer fra lærebøker, oppslagsverk, aviser, tidsskrifter, reklame og Internett.

source: Working with various types of texts and other cultural expressions is important for developing linguistic skills and understanding how others live, and their cultures and views on life.
nb: Arbeid med ulike typer tekster og kulturelle uttrykksformer er her sentralt for utvikling av språkferdigheter og forståelse for andres levesett, kulturer og livssyn.

source: It is based on the English-speaking world and covers key topics connected to social issues, literature and other cultural expressions.
nb: Det tar utgangspunkt i engelskspråklige land og dekker sentrale emner om samfunnsliv, litteratur og andre kulturuttrykk blant hørende og hørselshemmede.

source: Acids and bases
nb: Kor og ensemble

source: express and justify own opinions about different topics
nb: samtale og diskutere på norsk eller tegnspråk tverrfaglige emner

source: One objective of the programme subject is to help individuals understand that trustworthy early warning methods do, in fact, exist and that international cooperation is necessary for getting the most out of early-warning systems and for preventing damage.
nb: Et formål med programfaget er å bidra til at den enkelte får forståelse av at det ikke finnes sikre varslingsmetoder, og at internasjonalt samarbeid er nødvendig for å få til best mulig varsler og forebygging av skader.

source: The pupils demonstrate and develop competence in the subject in year 5 when exploring and reflecting on different mathematical concepts, representations and strategies when working with fractions and informal solving of equations and inequalities.
nb: Elevene viser og utvikler kompetanse i faget på 5. trinn når de utforsker og reflekterer over ulike matematiske begreper, representasjoner og strategier i arbeid med brøk og uformell løsing av ligninger og ulikheter.

source: important changes in how people have obtained food and used natural resources and
nb: viktige endringer i hvordan mennesker har skaffet seg mat og brukt naturressurser, og

source: That may help develop their democratic skills.’
nb: Det kan utvikle deres demokratiske ferdigheter.

source: use digital tools to present work in the social sciences and comply with the rules for personal data protection and copyright
nb: bruke digitale verktøy til å presentere samfunnsfaglig arbeid og følge regler for personvern og opphavsrett

source: The joy of innovation, the urge to explore and responsible participation are fundamental social and personal values.
nb: Skaperglede, utforskertrang og ansvarlig medvirkning er grunnleggende verdier for samfunnet og individet.

source: Good communication requires knowledge and skills in using vocabulary and idiomatic structures, pronunciation, intonation, spelling, grammar and syntax of sentences and texts.
nb: Hovedområdet omfatter også å skrive engelske tekster i ulike kommunikasjonssituasjoner for å stimulere til skriveglede og opplevelse, og for å forstå og tilegne seg kunnskap.

source: carry out work at a fish farm in accordance with relevant environment, health and safety regulations
nb: utføre arbeidet i oppdrettsanlegget i samsvar med gjeldende regelverk for helse, miljø og sikkerhet

source: But when we started working more consciously with attachment, something happened.
nb: Men da vi begynte å jobbe mer bevisst med relasjoner, skjedde det noe.

source: Sonny eventually sits on the bench.
nb: Sonny setter seg etter hvert på benken.

source: In the interviews, the floor was opened for group discussions among the employees about values.
nb: I intervjuene åpnet forskeren opp for gruppediskusjoner med de ansatte om verdier.

source: Here Nome studies how children try to create more private rooms and relations.
nb: Her undersøker Nome hvordan barna forsøker å skape mer private rom og relasjoner.

source: You have to ponder a bit before you understand what is.
nb: Du må tenke litt før du oppdager hva det er.

source: At 9.30 a.m., they all line up at the gate and walk the 300 metres over to their forest location as a group.
nb: Klokka 9.30 stiller de opp ved porten og går samlet de rundt 300 meterne over til skogen sin.

source: At lower secondary level, the main subject area shall also give insight into other religions and philosophies of life that are represented in Norway, including the diversity of other religions and philosophies of life.
nb: På ungdomstrinnet skal dette hovedområdet også gi innblikk i andre religioner og livssyn som er representert i Norge, og i annet religiøst og livssynsmessig mangfold.

source: make and use sketches and drawings to formulate and solve problems and to present and provide rationale for chosen solutions, with and without using digital tools
nb: lage og bruke skisser og tegninger til å formulere problemstillinger, i oppgaveløsning og til å presentere og begrunne løsningene, med og uten bruk av digitale verktøy

source: Education and Training publishes results from the national tests on all levels in the school system.
nb: Vurdererne får opplæring i metodikken lokalt eller i regi av Utdanningsdirektoratet, og kan

source: present important themes and modes of expression in a selection of key contemporary texts and some classical texts from Norwegian literature
nb: kjærlighet og kjønnsroller, helt og antihelt, virkelighet og fantasi, makt og motmakt, løgn og sannhet, oppbrudd og ansvar

source: Statistics covers planning, collecting, organising, analysing and presenting data.
nb: Statistikk omfatter å planlegge, samle inn, organisere, analysere og presentere data.

source: explain the point of departure for the Islamic manner of calculating historic time, and describe Islamic holidays, festivals and central rituals
nb: forklare utgangspunktet for islamsk tidsregning og beskrive islamske høytider og sentrale ritualer

source: Several kindergarten employees who participated in the researchers’ study mentioned that it was difficult for them to know how to deal with such issues, so they waited for the situation to blow over.
nb: Flere av de barnehageansatte som deltok i forskernes undersøkelse, fortalte at de hadde problemer med å vite hvordan de skulle håndtere problemer, og dermed ventet de på at det skulle gå over av seg selv.

source: assess and converse about probability in day-to-day contexts, games and experiments and calculate probability in simple situations
nb: vurdere og samtale om sjanser i dagligdagse sammenhenger, spill og eksperimenter og beregne sannsynlighet i enkle situasjoner

source: To reflect means to examine and consider different aspects of your own and others’ actions, attitudes and ideas.
nb: Å drøfte er å belyse en sak ved å trekke fram forskjellige sider av den, og argumentere både for og imot.

source: Listening and speaking are part of day-to-day socialising and are key elements for social and cultural competence and for aesthetic development and appreciation.
nb: Hovedområdet omhandler utvikling av ulike språklige roller og sjangere og forståelse for hvordan man tilpasser språk og form til mottaker, kommunikasjonssituasjon og til formål med teksten.

source: One of the main goals for instruction in basic Norwegian is the development of linguistic confidence and self-assurance.
nb: Et hovedmål for opplæringen i grunnleggende norsk er utvikling av språklig selvtillit og trygghet.

source: Anette Emilson has taken videos of 30 preschool children, aged one to three, and their seven preschool teachers.
nb: Anette Emilson har videofilmet 30 barnehagebarn mellom ett og tre år og deres syv barnehagelærere.

source: The pupils are provided with tools to explore opinions, ideas and emotions, and to express themselves through different formats and arenas.
nb: Elevene får verktøy til å utforske meninger, ideer og følelser og til å uttrykke seg gjennom ulike formater og arenaer.

source: listen to and be receptive to the arguments of others and use relevant and rational arguments in discussions
nb: lytte til og vise åpenhet for andres argumentasjon og bruke relevante og saklige argumenter i diskusjoner

source: They were better not only at cooperation, but also at improvisation.
nb: De ble både bedre til å samarbeide og til å improvisere.

source: discuss social and cultural conditions and values from a number of English-speaking countries
nb: drøfte sosiale og kulturelle forhold, samfunnsforhold og verdier i flere engelskspråklige land

source: Cooperation with the homeParents/guardians have the main responsibility for their own children and are of major importance when it comes to children’s motivation and what they learn.
nb: Læreres og instruktørers kompetanse og rolleSom tydelige ledere skal lærere og instruktører skape forståelse for formålene med opplæringen og framstå som dyktige og engasjerte formidlere og veiledere.

source: This main subject area deals with natural and synthetic organic substances.
nb: Hovedområdet handler om naturlige og syntetiske organiske stoffer.

source: use simple strategies for reading comprehension
nb: forstå og samtale om innholdet i enkle tegnspråktekster

source: The pupils should develop awareness of their own language situation and acquire knowledge of Sign Language as a step towards developing their language skills and identity.
nb: Videre dreier det seg om sammenhengen mellom uttrykksformer i tegnspråk og det samfunnet og kulturen som omgir og påvirker språket.

source: This information comes from researcher Margrethe Jernes of the University of Stavanger.
nb: Det forteller forsker Margrethe Jernes ved Universitetet i Stavanger.

source: carry out experiments with magnetism and electricity, describe and explain the results
nb: gjennomføre forsøk med magnetisme og elektrisitet, beskrive og forklare resultatene

source: Some children have a tough time after a parental break-up.
nb: • Noen barn har det vanskelig etter et samlivsbrudd.

source: Classroom teaching shall not include preaching, proselytising or religious practice.
nb: I undervisningen skal det ikke være forkynnelse eller religionsutøvelse.

source: in Basic Norwegian for language minorities involves learning to write in Norwegian and developing one’s writing skills.
nb: i grunnleggende norsk for språklige minoriteter innebærer å lære å skrive på norsk og videreutvikle sine skriveferdigheter.

source: this with strategies for calculating with whole numbers
nb: med regnestrategier for hele tall

source: There are, however, ‘reindeer Sámi’ in Tromsø, and some of children have relatives in the reindeer husbandry business.
nb: Men det finnes reindriftssamer i Tromsø, og noen av barna har slektninger som driver med rein.

source: express and justify own views while respecting the views of others
nb: lytte til og forstå andre, uttrykke og grunngi sine egne standpunkter og vise respekt for andres

source: Research and technological innovations are giving us more and more knowledge about the universe.
nb: Gjennom forskning og teknologiske nyvinninger øker kunnskapen om verdensrommet.

source: They also demonstrate and develop competence when using knowledge and skills to formulate and solve problems related to practical situations in everyday life and in society.
nb: Elevene viser og utvikler også kompetanse når de bruker kunnskap og ferdigheter til å formulere og løse problemer som er knyttet til praktiske situasjoner i hverdagen og i samfunnet.

source: understand and fill out simple forms with personal information
nb: forstå og fylle ut enkle skjemaer med personlige opplysninger

source: understand the main content of oral texts about familiar topics
nb: lese og skrive tekster i ulike sjangere, både skjønnlitteratur og sakprosa på hovedmålet:

source: use a variety of digital search strategies to find and compare information that describes problems from different points of view and evaluate the objectives and relevance of one’s sources
nb: bruke varierte digitale søkestrategier for å finne og sammenlikne informasjon som beskriver problemstillinger fra ulike synsvinkler, og vurdere kildenes formål og relevans

source: It also generates more time for linguistic stimulation and learning.”
nb: Det gir også mer tid til språklig stimulering og læring.

source: receive and give information and messages in a variety of situations
nb: ta imot og gi informasjon og beskjeder i ulike situasjoner

source: growth factors and exponential functions
nb: vekstfaktor og eksponentialfunksjoner
